app/Http/Resources/ProductReportResource.php

            'diagnostic' => $this->diagnostic,
            'status' => $this->status,

            'customizations' => $this->customizations,
            'checkComment' => $this->check_comment,
            'issueComment' => $this->issue_comment,
            'batteryVoltage' => $this->battery_voltage,
            'batteryCapacity' => $this->battery_capacity,
            'batteryLook' => $this->battery_look,
            'batteryCharge' => $this->battery_charge,
            'batteryIssue' => $this->battery_issue,
            'batteryCurrentVoltage' => $this->battery_current_voltage,
            'batteryCycles' => $this->battery_cycles,
            'batteryCurrentCapacity' => $this->battery_current_capacity,
            'createdAt' => $this->created_at,
            'updatedAt' => $this->updated_at,
            'serial' => new SerialResource($this->return->serial),
            'item' => new ItemResource($this->return->item),
            'replacementItems' => $this->replacementItems,
            'order' => $this->order
        ];
---
select * from `serials` where `serials`.`id` = 254500 and `serials`.`deleted_at` is null limit 1
select * from `items` where `items`.`id` = 97 and `items`.`deleted_at` is null limit 1