app/Http/Controllers/Api/v1/BatteryResourceController.php

    public function index()
    {
        return BatteryStateResource::collection(BatteryState::all());
---
select * from `battery_states`