app/Http/Controllers/Api/v1/ContactController.php

    public function index(Request $request)
    {
        if($request->q) {
            $contacts = Contact::query()->where(function ($query) use ($request) {
                $query->where('name', 'like', '%' . $request->q . '%');
                $query->orWhere('code', 'like', '%' . $request->q . '%');
            })->get();
---
select * from `contacts` where `code` like '%701780%' and `contacts`.`deleted_at` is null