app/Http/Controllers/Api/v1/ItemController.php

select * from `items` where `itno` like '%null%' and `items`.`deleted_at` is null
---
    public function index(Request $request)
    {
        if($request->q) {
            $items = Item::where('itno', 'like', '%'.$request->q.'%')->get();
        } else {
            $items = Item::all();