app/Http/Controllers/Api/v1/ProductReportController.php

select * from `product_reports` where `identifier` = 'OSAZHQ' and `product_reports`.`deleted_at` is null limit 1
---
    public function show(string $identifier)
    {
        return new ProductReportResource(ProductReport::where('identifier', $identifier)->firstOrFail());