app/Http/Controllers/Api/v1/SerialController.php

select * from `serials` where `code` like '%16789234%' and `serials`.`deleted_at` is null
---
    public function index(Request $request)
    {
        if($request->q) {
            $serials = Serial::where('code', 'like', '%'.$request->q.'%')->get();