app/Http/Controllers/Api/v1/TicketController.php

select * from `tickets` where `id` like '24613%' and `tickets`.`deleted_at` is null
---
    public function index(Request $request)
    {
        if ($request->q) {
            $tickets = Ticket::where('id', 'like', $request->q.'%')->get();
        } else {
            $tickets = Ticket::all();