app/Livewire/ContactsIndex.php

    public function render()
    {
        $contacts = Contact::where(function ($query) {
            return $query->whereAny(['code', 'name'], 'like', '%' . $this->searchTerm . '%');
        })->orderBy('code')->paginate(15);
---
select * from `contacts` where ((`code` like '%%' or `name` like '%%')) and `contacts`.`deleted_at` is null order by `code` asc limit 15 offset 0
select count(*) as aggregate from `contacts` where ((`code` like '%%' or `name` like '%%')) and `contacts`.`deleted_at` is null