app/Livewire/GroupsIndex.php

    public function render()
    {
        $groups = Group::where(function ($query) {
            $query->whereAny(['code', 'name'], 'like', '%' . $this->searchTerm . '%');
        })->orderBy('code')->paginate(10);
---
select * from `groups` where ((`code` like '%%' or `name` like '%%')) and `groups`.`deleted_at` is null order by `code` asc limit 10 offset 0
select count(*) as aggregate from `groups` where ((`code` like '%%' or `name` like '%%')) and `groups`.`deleted_at` is null