app/Livewire/ProductReportsIndex.php

    public function render()
    {
        $reports = ProductReport::where(function ($query) {
            $query->whereAny(['identifier'], 'like', '%' . $this->searchTerm . '%');
            $query->orWhereHas('return', function ($query) {
                $query->where('ticket_id', 'like', '%' . $this->searchTerm . '%');
                $query->orWhereHas('ticket', function ($query) {
                    $query->whereHas('contact', function ($query) {
                        $query->where('name', 'like', '%' . $this->searchTerm . '%');
                        $query->orWhere('email', 'like', '%' . $this->searchTerm . '%');
                        $query->orWhere('code', 'like', '%' . $this->searchTerm . '%');
                    });
                });
            });
        })
            ->orderBy('updated_at', 'desc')->paginate(10);
---
select count(*) as aggregate from `product_reports` where ((`identifier` like '%%')) and `product_reports`.`deleted_at` is null