app/Livewire/ProductReturnsIndex.php

    public function render()
    {
        $items = ProductReturn::where(function ($query) {
            $query->whereAny(['identifier', 'serial_code', 'routing_from_code', 'ticket_id', 'item_itno', 'serial_code'], 'like', '%' . $this->searchTerm . '%');
            $query->orWhereHas('ticket', function ($query) {
                $query->whereHas('contact', function ($query) {
                    $query->where('name', 'like', '%' . $this->searchTerm . '%');
                    $query->orWhere('code', 'like', '%' . $this->searchTerm . '%');
                    $query->orWhere('email', 'like', '%' . $this->searchTerm . '%');
                });
            });
        })
            ->when($this->trashed, function ($query) {
                return $query->onlyTrashed();
            })
            ->when($this->status, function ($query) {
                return $query->where('status', $this->status);
            })
            ->when($this->environment, function ($query) {
                return $query->where('environment', $this->environment);
            })
            ->when($this->order, function ($query) {
                if ($this->order === 'updated_at_desc') {
                    return $query->orderBy('updated_at', 'desc');
                } else if ($this->order === 'created_at_desc') {
                    return $query->orderBy('created_at', 'desc');
                } else if ($this->order === 'updated_at_asc') {
                    return $query->orderBy('updated_at');
                } else if ($this->order === 'created_at_asc') {
                    return $query->orderBy('created_at');
                } else if ($this->order === 'received_at_desc') {
                    return $query->orderBy('received_at', 'desc');
                } else if ($this->order === 'received_at_asc') {
                    return $query->orderBy('received_at');
                }
            })
            ->orderBy('updated_at', 'desc')->paginate(10)->withQueryString();
---
select count(*) as aggregate from `product_returns` where ((`identifier` like '%%' or `serial_code` like '%%' or `routing_from_code` like '%%')) and `product_returns`.`deleted_at` is not null
select * from `product_returns` where ((`identifier` like '%%' or `serial_code` like '%%' or `routing_from_code` like '%%')) and `product_returns`.`deleted_at` is not null order by `created_at` desc limit 10 offset 0