app/Livewire/RolesIndex.php

select * from `roles`
---
    public function render()
    {
        $roles = Role::all();