app/Livewire/SerialsIndex.php

    public function render()
    {
        $serials = Serial::where(function ($query) {
            $query->whereAny(['code', 'item_itno', 'dealer_code'], 'like', '%' . $this->searchTerm . '%');
            $query->when($this->orphans, function ($query) {
                $query->doesnthave('item');
            });
        })->paginate(10);
---
select * from `serials` where ((`code` like '%%' or `item_itno` like '%%' or `dealer_code` like '%%')) and `serials`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `serials` where ((`code` like '%%' or `item_itno` like '%%' or `dealer_code` like '%%')) and `serials`.`deleted_at` is null