app/Livewire/TicketsIndex.php

select * from `tickets` where (`id` like '%%' or `requester_name` like '%%' or `requester_email` like '%%') and `tickets`.`deleted_at` is null order by `created_at` desc limit 30 offset 0
select count(*) as aggregate from `tickets` where (`id` like '%%' or `requester_name` like '%%' or `requester_email` like '%%') and `tickets`.`deleted_at` is null
---
    public function render()
    {
        $tickets = Ticket::where(function ($query) {
            $query->where('id', 'like', '%' . $this->searchTerm . '%');
            $query->orWhere('requester_name', 'like', '%' . $this->searchTerm . '%');
            $query->orWhere('requester_email', 'like', '%' . $this->searchTerm . '%');
        })
            ->withCount('fields', 'comments')
            ->orderBy('created_at', 'desc')->paginate(30);