app/Livewire/UsersIndex.php

select * from `users` where ((`name` like '%%' or `email` like '%%')) order by `name` asc limit 10 offset 0
select count(*) as aggregate from `users` where ((`name` like '%%' or `email` like '%%'))
---
    public function render()
    {
        $users = User::where(function ($query) {
            $query->whereAny(['name', 'email'], 'like', '%' . $this->searchTerm . '%');
        })->orderBy('name')->paginate(10);