app/Http/Controllers/ProductReturnController.php

    public function index()
    {
        if(!Auth::user()->can('returns.read')) {
            \ToastMagic::error('You do not have permission to access this page.');
            return redirect()->route('dashboard');
        }

        $returns_count = ProductReturn::count();
---
select count(*) as aggregate from `product_returns` where `product_returns`.`deleted_at` is null



        try {
            $return = ProductReturn::create([
                'identifier' => AlphacodeHelper::generateCode(6),
                ...$data,
                'author_id' => auth()->user()->id,
                'status' => $request->status ?? ProductReturn::STATUS_INCOMPLETE,
            ]);

            if ($request->ticket) {
                $return->ticket()->associate(Ticket::findOrFail($request->ticket));
---
insert into `product_returns` (`identifier`, `type`, `context`, `reason`, `assignation`, `action`, `destination`, `ticket_id`, `item_id`, `item_itno`, `serial_code`, `serial_itno`, `serial_itds`, `serial_id`, `bike_sold_at`, `order`, `invoice`, `delivery`, `info`, `note`, `routing_from_id`, `routing_from_code`, `routing_from_address1`, `routing_from_address2`, `routing_from_city`, `routing_to_id`, `routing_to_code`, `routing_to_address1`, `routing_to_address2`, `routing_to_city`, `return_to_id`, `return_to_code`, `return_to_address1`, `return_to_address2`, `return_to_city`, `author_id`, `status`, `updated_at`, `created_at`) values ('NWETVC', 'bike', 'hors_garantie', 'velo_pret', 'qualite', 'expertise', 'recyclage', '24613', null, null, '16682213', 'YOU5184002', 'eLC-01 V2  9D140O2B 105484/11a', 254480, '2026-02-03', 'CDE678', 'INV6789', 'BL678', 'COmmentaire client', 'Commentaire interne', 13428, '70110023', 'MEHDI RAHI', '2 RUE DE GUE', 'VILLERET', 7331, '70178047', '.', '8 RUE JEAN-BAPTISTE HUET', 'JOUY-EN-JOSAS', null, null, null, null, null, 1, 'incomplete', '2025-10-21 11:43:26', '2025-10-21 11:43:26')
select * from `tickets` where `tickets`.`id` = '24613' and `tickets`.`deleted_at` is null limit 1

    public function show($id)
    {
        if(!auth()->user()->hasAnyPermission('returns.read')) {

            \ToastMagic::error('You do not have permission to access this page.');
            return redirect()->route('dashboard');

        }

        return view('returns.show')
            ->with('productReturn', ProductReturn::where('identifier', $id)->first());
---
select * from `product_returns` where `identifier` = 'AFGXRW' limit 1

            ...$reshippedTo,
            'status' => $request->status,
        ];
        $productReturn = ProductReturn::find($id);
        $productReturn->update($data);
---
select * from `product_returns` where `product_returns`.`id` = '62' and `product_returns`.`deleted_at` is null limit 1
update `product_returns` set `status` = 'received', `received_at` = '2025-10-21 14:00:43', `product_returns`.`updated_at` = '2025-10-21 14:00:43' where `id` = 62

    private function getItem(string|null $item): array
    {
        return [
            'item_id' => Item::where('itno', $item)->first()->id ?? null,
            'item_itno' => $item ?? null,
        ];
---
select * from `items` where `itno` = 'C4305013' and `items`.`deleted_at` is null limit 1

    private function getSerial(
        string|null $code,
        string|null $designation,
        string|null $sku,
        string|null $brand): array
    {
        return [
            'serial_code' => $code,
            'serial_itno' => $sku,
            'serial_itds' => $designation,
            'serial_ictl' => $brand,
            'serial_id' => Serial::where('code', $code)->first()->id ?? null,
        ];
---
select * from `serials` where `code` = '16682213' and `serials`.`deleted_at` is null limit 1

    private function getSender(
        string|null $prefix,
        string|null $code,
        string|null $address1,
        string|null $address2,
        string|null $postcode,
        string|null $city
    ): array
    {
        return [
            $prefix . 'id' => Contact::where('code', $code)->first()->id ?? null,
            $prefix . 'code' => $code ? trim($code) : null,
            $prefix . 'address1' => $address1 ? trim($address1) : null,
            $prefix . 'address2' => $address2 ? trim($address2) : null,
            $prefix . 'postcode' => $postcode ? trim($postcode) : null,
            $prefix . 'city' => $city ? trim($city) : null,
        ];
---
select * from `contacts` where `code` = '70178055' and `contacts`.`deleted_at` is null limit 1

    private function getRecipient(
        string|null $prefix,
        string|null $code,
        string|null $address1,
        string|null $address2,
        string|null $postcode,
        string|null $city
    ): array
    {
        return [
            $prefix . 'id' => Contact::where('code', $code)->first()->id ?? null,
            $prefix . 'code' => $code ? trim($code) : null,
            $prefix . 'address1' => $address1 ? trim($address1) : null,
            $prefix . 'address2' => $address2 ? trim($address2) : null,
            $prefix . 'postcode' => $postcode ? trim($postcode) : null,
            $prefix . 'city' => $city ? trim($city) : null,
        ];
---
select * from `contacts` where `code` is null and `contacts`.`deleted_at` is null limit 1