app/Http/Controllers/ProductReportController.php

select count(*) as aggregate from `product_reports` where `product_reports`.`deleted_at` is null
---
    public function index()
    {

        if(!Auth::check() && !Auth::user()->can('reports.read')) {
            \ToastMagic::error('You do not have permission to access this page.');
            return redirect()->route('dashboard');
        }

        $reports_count = ProductReport::count();

select * from `product_reports` where `identifier` = 'OSAZHQ' and `product_reports`.`deleted_at` is null limit 1
---
    public function start(Request $request, $id)
    {
        if(!Auth::user()->can('reports.update')) {
            \ToastMagic::error('You do not have permission to access this page.');
            return redirect()->route('dashboard');
        }
        try {
            ProductReport::find($id)->update([
                'started_at' => now(),
                'technician_id' => auth()->user()->id,
                'status' => ProductReport::STATUS_IN_PROGRESS
            ]);
        } catch (Exception $exception) {
            ToastMagic::error($exception->getMessage());
            return redirect()->back();
        }

        return redirect()->route('support.reports.edit', ProductReport::find($id)->identifier);