app/Http/Controllers/RoleController.php

    public function create()
    {
        $role_permission = Permission::select('id', 'name')->groupBy('name')->get();
        $custom_permission = array();

        foreach ($role_permission as $permission) {
            $key = substr($permission->name, 0, strpos($permission->name, '.'));
            if (str_starts_with($permission->name, $key)) {
                $custom_permission[$key][] = $permission;
            }
        }
        return view('roles.create')
            ->with('permissions', $custom_permission);
---
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (2)

    public function edit($id)
    {
        $role = Role::find($id);
---
select * from `roles` where `roles`.`id` = '2' limit 1

    public function update(Request $request, $id)
    {
        try {
            $role = Role::find($id);
---
select * from `roles` where `roles`.`id` = '1' limit 1