app/Http/Controllers/SerialController.php

select count(*) as aggregate from `serials` where not exists (select * from `items` where `serials`.`item_id` = `items`.`id` and `items`.`deleted_at` is null) and `serials`.`deleted_at` is null
---
    public function index()
    {
        if(!Auth::user()->can('serials.read')) {
            \ToastMagic::error('You do not have permission to access this page.');
            return redirect()->route('dashboard');
        }
        $orphans = Serial::doesntHave('item')->count();