app/Http/Controllers/UserController.php

    public function create()
    {
        $roles = Role::all();
---
select * from `roles`

    public function show($id)
    {
        $user = User::find($id);
---
select * from `users` where `users`.`id` = '6' limit 1

    public function edit($id)
    {
        $user = User::find($id);
        $roles = Role::all();
---
select * from `roles`

    public function update(Request $request, $id)
    {
        try {
            $user = User::find($id);
---
select * from `users` where `users`.`id` = '6' limit 1